/-! # イデアル

## 定義

整数の部分集合 $I ⊆ ℤ$ が ( $ℤ$ の) {{i:イデアル}}であるとは，次を満たすことをいいます．

* $I$ は $0$ を含む．
* $I$ で引き算ができる．つまり，任意の $x ∈ I$ に対して $-x ∈ I$.
* $I$ は加法に対して閉じている．つまり，任意の $x, y ∈ I$ に対して $x + y ∈ I$.
* 任意の整数 $a ∈ ℤ$ に対して $x ∈ I$ ならば $a x ∈ I$.

## イデアルの典型例

定義からすぐ従うことですが，具体例として次のものがあります．

* $ℤ$ 自身は $ℤ$ のイデアルです．
* また，$0$ だけからなる集合 $\\{0\\}$ もイデアルです．

しかしイデアルの典型的な例は，ある整数 $a₁, a₂, ... , aₙ ∈ ℤ$ に対して，

$$
\\{ a₁ x₁ + a₂ x₂ + ... + aₙ xₙ ∣ x₁, x₂, ... , xₙ ∈ ℤ \\}
$$

として定義される集合です．これを {{i:$a₁, a₂, ... , aₙ$ で生成されるイデアル}}といい，$a₁ ℤ + a₂ ℤ + ... + aₙ ℤ$ と表します．

特に，$a ∈ ℤ$ の倍数の全体もイデアルで，$a ℤ$ と書きます．

## イデアルをなぜ考えるのか

イデアルという言葉をここで導入したのは，「$a₁, a₂, ... , aₙ ∈ ℤ$ の倍数を任意に選んで足し合わせたもの」を表す簡潔な言葉を用意するためです．本来イデアルは整数だけでなく，多項式全体 $ℚ [X₁, ... , Xₙ]$ や，整数に無理数を足したもの $ℤ [\sqrt{2}]$ など様々な対象に対して定義できる興味深い概念ですが，ここでは深い話に触れることはありません．したがって，便利な略称程度に思っていただきたいと思います．

-/
